{
	"title": "Apotris",
	"description": "A free and multiplatform block stacking game",
	"long_description": "**Apotris** is a free multiplatform open-source block stacking game! What sets Apotris apart from other block stacking games is its extensive customization options, complemented by ultra-responsive controls that let you execute your moves with precision. With 14 unique game modes and a plethora of settings, you can tailor the game to your preferences, ensuring a fresh and challenging experience every time you play. Whether you're a casual player or a hardcore enthusiast, Apotris has something for everyone. <!--You can even battle your friends using the Gameboy Advance Link Cable or Wireless Adapters in 2-Player Battle!--> While Apotris was originally designed for Gameboy Advance, it now supports all kinds of platforms, so between the ports and emulation you can play Apotris on almost anything.\n\nThe game is still actively maintained and new features are added constantly. If you have any suggestions, want to learn about new features or participate in beta releases, join the Apotris discord server!\n\n### Game-modes:\n\n* **Marathon**: Try to get the best score as the game gets faster and faster\n* **Sprint**: Clear lines to reach the goal as fast as possible\n* **Dig**: Dig through lines of garbage\n* **Ultra**: Get the best score in a limited time\n* **Blitz**: Get the best score in a limited time while the game gets faster and faster\n* **Combo**: Aim for the most consecutive clears in a 4-wide well\n* **Survival**: Survive as long as possible while garbage rises from below\n* **Classic**: Old school stacking mechanics\n* **Master**: Get the highest Grade while the game gets aggressively faster\n* **Death**: Try to survive at brutal speeds\n* **Zen**: The goal is to relax...\n* **2P Battle**: Battle your friends through the Link Cable or Wireless Adapter (GBA Only!)\n* **CPU Battle**: Go against an AI opponent\n* **Training**: Try out new strategies or improve your playing using the included Finesse Trainer",
	"author": "akouzoukos",
	"website": "https://akouzoukos.com/apotris",
	"source": "https://gitea.com/akouzoukos/apotris",
	"wiki": "https://github.com/akouzoukos/apotris/wiki",
	"license": "AGPL-3.0-only",
	"license_name": "GNU Affero General Public License v3.0 only",
	"created": "2022-04-16T00:02:43Z",
	"color": "#ffe74a",
	"color_bg": "#7d2999",
	"systems": ["3DS"],
	"categories": ["game"],
	"unique_ids": [694037],
	"version": "v4.1.0",
	"updated": "2025-04-19T17:31:10.551Z",
	"download_page": "https://akouzoukos.com/apotris/downloads",
	"update_notes_md": "## v4.1.0 \n\n- New Port:\n  - Nintendo 3DS (by Alvin Wong)\n- Added the Color Editor:\n  - Lets you create and manage up to 3 custom color palettes.\n- Added HSV value editing capability to the Gradient Editor.\n- Added the ability to skip the current music track from the pause menu.\n- Added a timeout (3 minutes) to the demo mode.\n- Disabled rumble during demo mode and replays.\n- Re-added the option to darken the ghost piece.\n- Greatly improved random number generation to prevent cases where the numbers generated weren't very random (by Luigi)\n- Fixed Classic Mode DAS wallcharge being overridden by NRS charge.\n- Fixed Classic Mode high scores saving based on frames instead of score.\n- Fixed ARS T-piece wall kicks.\n- Fixed issues with replay playback during Master/Death mode credit rolls.\n- Fixed stat accumulation occurring after high score saving.\n- Fixed graphics option randomizer (some options were never chosen).\n- Fixed bone skin sometimes not being removed after a Death mode game ended.\n- Fixed incorrect grade names displayed in Death mode results.\n- Fixed enable rumble notification text glitching.\n- Fixed potential crash if the music track list was empty.\n- Fixed gradient editor rendering issues.\n- Fixed demo mode games from counting towards total games started statistic.\n- Removed F11 fullscreen keybind (now handled by options).\n- (Windows / Linux / Portmaster) Added *Shader Support*\n- (PC / Web) Added *Controller Support*\n- (PC / PortMaster / Switch) Added *Rumble Support*\n- (PC) Added an option for persistent fullscreen mode in Video Settings.\n- (PC) Fixed the \"Save Replays\" option in Training Mode not working correctly\n- (GBA) Improved Multiplayer stability\n- (GBA) Added detection for more flash save chip types.\n- (Switch) Added custom music track support\n- (Portmaster) Resolved various crashes and issues on specific Portmaster hardware",
	"downloads": {
		"Apotris-v4.1.03DS.zip": {
			"url": "https://apotrisstorage.blob.core.windows.net/binaries/Apotris-v4.1.03DS.zip"
		}
	},
	"archive": {
		"Apotris-(.*-)?3(ds|DS)(-.*)?\\.zip": {
			"Apotris.3dsx + assets": [
				"3ds/Apotris/assets/",
				"3ds/Apotris/license/",
				"3ds/Apotris/Apotris.3dsx"
			],
			"Apotris.cia + assets": [
				"3ds/Apotris/assets/",
				"3ds/Apotris/license/",
				"3ds/Apotris/Apotris.cia"
			]
		}
	}
}
