{
	"github": "TheHighTide/CubeAdventures",
	"title": "Cube Adventures",
	"systems": ["3DS"],
	"categories": ["game"],
	"long_description": "# Cube Adventure\n## About:\n### What is it?\n**Cube Adventures** is a basic 2d platformer where your goal is to get through all the levels as a red cube. You have to find a path through the levels that doesn't involve getting sent back to the start via (example) touching a lava tile. The simple nature of **Cube Adventures** makes it playable on every 3DS console in the family (including the 2DS systems).\n\n### Controls\nThis game features incredibly simple controls making it really easy to get used to. Although the controls can be seen on the bottom screen during gameplay, I'll also list them here:\n**A** = Jump / Menu Select\n**DPAD Left** & **DPAD Right** = Move Left & Right\n**START** = Return to main menu\n**R**+**L** = Toggle dev mode\n**SELECT** = Change level (Only usable while dev mode is active)\nPS: More information can be found about dev mode in the _features_ section below.\n\n## Features:\n### Sprites\n**Cube Adventures** features an incredibly simple graphics style. This is due to the lack of sprites the game uses. **Cube Adventures** only uses colors and squares to display images onto the screen making it incredibly simple and graphically simple to run.\n\n### Levels\n**Cube Adventures** features a number of unique levels for you to explore with the ability to make your own levels by compiling the game for yourself if you so choose. Its as easy as putting `1`s where you want ground to be and `0`s where you want nothing to be.\n\n### Dev Mode\n**Cube Adventures** makes compiling your own version of the game very simple as it gives you access to a feature called \"Dev Mode\". All _Dev Mode_ does is displays the current **x** & **y velocity** as well as the current coordinates to you on the bottom screen. This is extremely helpful when you start placing down coins and other items into the levels that you make.\n\n## Final Words:\nI want to thank you for checking out my game **Cube Adventures** and I hope you enjoy it. Also, make sure to check back from time to time to see if new feature updates are out as they might contain **bug fixes** or even **new levels**!"
}
